####################################################################################################
# This model is based on example models from YOLOv5 repository with some modifications
# so it could run on ESP32 with image resolution 96x96
####################################################################################################

# Parameters
nc: 4  # number of classes
depth_multiple: 0.17  # model depth multiple
width_multiple: 0.12  # layer channel multiple
anchors:
  - [11,8, 25,18, 46,43]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2   320x320x64
    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/      160x160x128
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8     80x80x256
    [-1, 3, C3, [256]],  # 4
    [-1, 1, SPPF, [256, 5]], # 5              80x80x256
  ]
# YOLOv5 v6.0 head
head:
  [
     [-1, 1, Conv, [256, 1, 1]], # 6          80x80x256
     [[-1, 4], 1, Concat, [1]],  # cat backbone P3
     [-1, 3, C3, [256, False]],  # 17 (P3/8-small)  # 9

     [[8], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
